In [25]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [26]:
# Name of the CSV file
file = 'Global.csv'

In [27]:
df = pd.read_csv(file, encoding="ISO-8859-1")

In [28]:
df

,Date,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,9/1/2013,15.252,1.056,Abbotsford,Canada,49.03N,122.45W
1,9/1/2013,25.791,1.180,Abilene,United States,32.95N,100.53W
2,9/1/2013,28.510,1.204,Acapulco,Mexico,16.87N,100.47W
3,9/1/2013,21.280,1.142,Aguascalientes,Mexico,21.70N,102.98W
4,9/1/2013,17.799,1.093,Akron,United States,40.99N,80.95W
...,...,...,...,...,...,...,...
546989,1/1/1900,3.127,0.604,Bolton,United Kingdom,53.84N,1.36W
546990,1/1/1900,24.573,0.861,Boma,Congo (Democratic Republic Of The),5.63S,12.91E
546991,1/1/1900,24.310,1.250,Bombay,India,18.48N,72.68E
546992,1/1/1900,2.079,0.545,Bonn,Germany,50.63N,6.34E
546993,1/1/1900,26.205,1.070,Bontang,Indonesia,0.80N,118.13E

In [29]:
df["Dir_Lat"] = df["Latitude"].str[-1]
df["Dir_Long"] = df["Longitude"].str[-1]
Latitude=df["Latitude"].copy()
df["Latitude"]=Latitude.str[:-1]
Longitude=df["Longitude"].copy()
df["Longitude"]=Longitude.str[:-1]
df

,Date,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,Dir_Lat,Dir_Long
0,9/1/2013,15.252,1.056,Abbotsford,Canada,49.03,122.45,N,W
1,9/1/2013,25.791,1.180,Abilene,United States,32.95,100.53,N,W
2,9/1/2013,28.510,1.204,Acapulco,Mexico,16.87,100.47,N,W
3,9/1/2013,21.280,1.142,Aguascalientes,Mexico,21.70,102.98,N,W
4,9/1/2013,17.799,1.093,Akron,United States,40.99,80.95,N,W
...,...,...,...,...,...,...,...,...,...
546989,1/1/1900,3.127,0.604,Bolton,United Kingdom,53.84,1.36,N,W
546990,1/1/1900,24.573,0.861,Boma,Congo (Democratic Republic Of The),5.63,12.91,S,E
546991,1/1/1900,24.310,1.250,Bombay,India,18.48,72.68,N,E
546992,1/1/1900,2.079,0.545,Bonn,Germany,50.63,6.34,N,E
546993,1/1/1900,26.205,1.070,Bontang,Indonesia,0.80,118.13,N,E

In [30]:
df.loc[(df.Dir_Lat == 'N'),'Dir_Lat']=1
df.loc[(df.Dir_Lat == 'S'),'Dir_Lat']=2
df.loc[(df.Dir_Long == 'W'),'Dir_Long']=1
df.loc[(df.Dir_Long == 'E'),'Dir_Long']=2
df

,Date,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,Dir_Lat,Dir_Long
0,9/1/2013,15.252,1.056,Abbotsford,Canada,49.03,122.45,1,1
1,9/1/2013,25.791,1.180,Abilene,United States,32.95,100.53,1,1
2,9/1/2013,28.510,1.204,Acapulco,Mexico,16.87,100.47,1,1
3,9/1/2013,21.280,1.142,Aguascalientes,Mexico,21.70,102.98,1,1
4,9/1/2013,17.799,1.093,Akron,United States,40.99,80.95,1,1
...,...,...,...,...,...,...,...,...,...
546989,1/1/1900,3.127,0.604,Bolton,United Kingdom,53.84,1.36,1,1
546990,1/1/1900,24.573,0.861,Boma,Congo (Democratic Republic Of The),5.63,12.91,2,2
546991,1/1/1900,24.310,1.250,Bombay,India,18.48,72.68,1,2
546992,1/1/1900,2.079,0.545,Bonn,Germany,50.63,6.34,1,2
546993,1/1/1900,26.205,1.070,Bontang,Indonesia,0.80,118.13,1,2

In [31]:
df=df[["Date", "AverageTemperature","Latitude","Longitude","Dir_Lat","Dir_Long"]]
df

            Date  AverageTemperature Latitude Longitude  Dir_Lat  Dir_Long
0       9/1/2013              15.252    49.03    122.45        1         1
1       9/1/2013              25.791    32.95    100.53        1         1
2       9/1/2013              28.510    16.87    100.47        1         1
3       9/1/2013              21.280    21.70    102.98        1         1
4       9/1/2013              17.799    40.99     80.95        1         1
...          ...                 ...      ...       ...      ...       ...
546989  1/1/1900               3.127    53.84      1.36        1         1
546990  1/1/1900              24.573     5.63     12.91        2         2
546991  1/1/1900              24.310    18.48     72.68        1         2
546992  1/1/1900               2.079    50.63      6.34        1         2
546993  1/1/1900              26.205     0.80    118.13        1         2

[546994 rows x 6 columns]

In [32]:
df['Date'] = pd.to_datetime(df['Date'])
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df=df[["Year","Month","Day", "AverageTemperature","Latitude","Longitude","Dir_Lat","Dir_Long"]]
df

,Year,Month,Day,AverageTemperature,Latitude,Longitude,Dir_Lat,Dir_Long
0,2013,9,1,15.252,49.03,122.45,1,1
1,2013,9,1,25.791,32.95,100.53,1,1
2,2013,9,1,28.510,16.87,100.47,1,1
3,2013,9,1,21.280,21.70,102.98,1,1
4,2013,9,1,17.799,40.99,80.95,1,1
...,...,...,...,...,...,...,...,...
546989,1900,1,1,3.127,53.84,1.36,1,1
546990,1900,1,1,24.573,5.63,12.91,2,2
546991,1900,1,1,24.310,18.48,72.68,1,2
546992,1900,1,1,2.079,50.63,6.34,1,2
546993,1900,1,1,26.205,0.80,118.13,1,2

In [33]:
df.to_csv('Globaldata.csv')

In [34]:
X = df[["Year", "Month", "Day","Latitude","Longitude","Dir_Lat","Dir_Long"]]
y = df[["AverageTemperature"]]
print(y)

AverageTemperature
0                   15.252
1                   25.791
2                   28.510
3                   21.280
4                   17.799
...                    ...
546989               3.127
546990              24.573
546991              24.310
546992               2.079
546993              26.205

[546994 rows x 1 columns]

In [35]:
from sklearn.datasets import make_regression
from sklearn.model_selection import train_test_split

In [36]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=20)
print(X_train.shape,y_train.shape,X_test.shape,y_test.shape)

(410245, 7) (410245, 1) (136749, 7) (136749, 1)

In [37]:
y.shape

(546994, 1)

In [39]:
from sklearn.ensemble import RandomForestRegressor
regr = RandomForestRegressor(max_depth=15, random_state=20)
train=regr.fit(X_train, y_train)
#regr.score(X_train, y_train)
print(train)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=15,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=10,
                      n_jobs=None, oob_score=False, random_state=20, verbose=0,
                      warm_start=False)

In [40]:
res=train.predict([[1985, 11, 1, '12.05', '14.79', 1, 1]])
print(y_test.loc[133940,:][0], res)

27.322 [26.46314126]

In [41]:
train.score(X_test.values,y_test.values)

0.9855058767798195

In [42]:
train.score(X_train.values,y_train.values)

0.988663718871983

In [44]:
import pickle
filename = 'Tempregression.sav'
pickle.dump(train, open(filename, 'wb'))

In [45]:
# load the model from disk
loaded_model = pickle.load(open(filename, 'rb'))
result = loaded_model.score(X_test, y_test)
print(result)

0.9855058767798195

In [47]:
loaded_model = pickle.load(open(filename, 'rb'))
res=loaded_model.predict([[2030, 11, 1, '12.05', '14.79', 1, 1]])
print(y_test.loc[133940,:][0], res)

27.322 [27.50178718]